posts/tech/2012-07-10-confusing-google-stats.org
#+BEGIN_HTML

---
layout:         post
title:          "Confusing Google Stats"
date:           2012-07-10 18:09
comments:       true
categories:     [google, search, bigdata, mapreduce]
published:      false
topic_title:    'Google Search Algorithm'
topic_search:   'google seo search algorithm'
---

#+END_HTML

While researching browser market share I ran a few Google searches. Each search was bounded for a specific period of time. While searching I started to notice some anomalies in the search results. Here are the search results that I got:

#+HTML: <div class="centered-table">
| Time Period Searched        | Millions Of Hits |
|-----------------------------+------------------|
| [[http://bit.ly/MXlWrB][Jun 6, 2012 - Jun 12, 2012]]  | 1.4              |
| [[http://bit.ly/MXlIAB][Jun 6, 2012 - Jun 12, 2012]]  | 1.7              |
| [[http://bit.ly/MXgTHx][Jun 13, 2012 - Jun 19, 2012]] | 1.4              |
| [[http://bit.ly/MXh0mt][Jun 20, 2012 - Jun 26, 2012]] | 1.3              |
| [[http://bit.ly/MXh3yw][Jun 27, 2012 - Jul 3, 2012]]  | 1.4              |
| [[http://bit.ly/MXhgSv][Jul 4, 2012 - Jul 10, 2012]]  | 7.2              |
|-----------------------------+------------------|
| *Total*                     | *15.8*           |
|                             |                  |
| [[http://bit.ly/MXi5uo][Jun 1, 2012 - Jul 10, 2012]]  | 41.8             |
|-----------------------------+------------------|
| *Difference*                | *26.0*           |
| *Percentage*                | *37.8*           |
| <c>                         | <c>              |
#+HTML:</div> <!-- centered-table -->

I understand that Google's results are not intended to be 100% reproducible. Their implementation of [[http://bit.ly/MXkXYp][MapReduce]]  trades accuracy for performance. That is, Google doesn't try to give you the best answer that it can based on its database. Rather, it tries to give you the best answer that it can in a very short amount of time. This leads to variations in the results based on the time of search, the location of the client computer, other ongoing Google activities, current network traffic, and various other [[http://bit.ly/MXofe9][numerological]] factors.


But the above results are showing a factor of 3 difference between the sum of the 5 weekly searches and the single search covering the same time period. I know that the [[http://en.wikipedia.org/wiki/Holism#History][whole is greater than the sum of its parts]] but I don't think that's the explanation for these results.


Either I'm misunderstanding how Google works or Google's search algorithm is having some problems. 
