posts/tech/2012-07-10-confusing-google-stats.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>---</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="---"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-10 20:34:04 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">---</h1>


---
layout:         post
title:          "Confusing Google Stats"
date:           2012-07-10 18:09
comments:       true
categories:     [google, search, bigdata, mapreduce]
published:      false
topic_title:    'Google Search Algorithm'
topic_search:   'google seo search algorithm'
---


<p>
While researching browser market share I ran a few Google searches. Each search was bounded for a specific period of time. While searching I started to notice some anomalies in the search results. Here are the search results that I got:
</p>


<div class="centered-table">
<table style='border: 2px solid black !important; border-collapse: separate;' cellspacing="0" cellpadding="6" rules="all" frame="2">
<caption></caption>
<colgroup><col class="center" /><col class="center" />
</colgroup>
<thead>
<tr><th scope="col" class="center">Time Period Searched</th><th scope="col" class="center">Millions Of Hits</th></tr>
</thead>
<tbody>
<tr><td class="center"><a href="http://bit.ly/MXlWrB">Jun 6, 2012 - Jun 12, 2012</a></td><td class="center">1.4</td></tr>
<tr><td class="center"><a href="http://bit.ly/MXlIAB">Jun 6, 2012 - Jun 12, 2012</a></td><td class="center">1.7</td></tr>
<tr><td class="center"><a href="http://bit.ly/MXgTHx">Jun 13, 2012 - Jun 19, 2012</a></td><td class="center">1.4</td></tr>
<tr><td class="center"><a href="http://bit.ly/MXh0mt">Jun 20, 2012 - Jun 26, 2012</a></td><td class="center">1.3</td></tr>
<tr><td class="center"><a href="http://bit.ly/MXh3yw">Jun 27, 2012 - Jul 3, 2012</a></td><td class="center">1.4</td></tr>
<tr><td class="center"><a href="http://bit.ly/MXhgSv">Jul 4, 2012 - Jul 10, 2012</a></td><td class="center">7.2</td></tr>
</tbody>
<tbody>
<tr><td class="center"><b>Total</b></td><td class="center"><b>15.8</b></td></tr>
<tr><td class="center"><a href="http://bit.ly/MXi5uo">Jun 1, 2012 - Jul 10, 2012</a></td><td class="center">41.8</td></tr>
</tbody>
<tbody>
<tr><td class="center"><b>Difference</b></td><td class="center"><b>26.0</b></td></tr>
<tr><td class="center"><b>Percentage</b></td><td class="center"><b>37.8</b></td></tr>
</tbody>
</table>

</div> <-- centered-table -->

I understand that Google's results are not intended to be 100% reproducible. Their implementation of <a href="http://bit.ly/MXkXYp">MapReduce</a>  trades accuracy for performance. That is, Google doesn't try to give you the best answer that it can based on its database. Rather, it tries to give you the best answer that it can in a very short amount of time. This leads to variations in the results based on the time of search, the location of the client computer, other ongoing Google activities, current network traffic, and various other <a href="http://bit.ly/MXofe9">numerological</a> factors.

<p>
But the above results are showing a factor of 3 difference between the sum of the 5 weekly searches and the single search covering the same time period. I know that the <a href="http://en.wikipedia.org/wiki/Holism#History">whole is greater than the sum of its parts</a> but I don't think that's the explanation for these results.
</p>
<p>
Either I'm misunderstanding how Google works or Google's search algorithm is having some problems. 
</p></div>

</body>
</html>
